cdhooper/amigapci_stm32/fw/pcmds.c
        if (config.flags != nvalue) {
            config.flags = nvalue;
            printf("Config flags %08lx ", nvalue);
            decode_bits(config_flag_bits, nvalue);
            printf("\n");
        }
        if (do_save)
            config_updated();
    } else if (strcmp(argv[1], "name") == 0) {
        config_name((argc < 2) ? NULL : argv[2]);
        return (RC_SUCCESS);
    } else if (strcmp(argv[1], "pson") == 0) {
        if (argc <= 2)
            return (RC_USER_HELP);
        if (strcmp(argv[2], "on") == 0) {
            config.ps_on_mode |= 1;
        } else if (strcmp(argv[2], "off") == 0) {
            config.ps_on_mode &= 1;
        } else {
            uint mode;
            int  pos = 0;
            if ((sscanf(argv[2], "%x%n", &mode, &pos) != 1) ||
                (argv[2][pos] != '\0') || (mode > 0xff)) {
                printf("Invalid argument: %s\n", argv[2]);
                return (RC_USER_HELP);
            }
            config.ps_on_mode = mode;
            config_updated();
        }
    } else if (strcmp(argv[1], "time") == 0) {
        return (cmd_time_set(argc - 1, argv + 1));
    } else {
        uint which;
        uint n = 1;
        uint do_save = 0;
        if (strcmp(argv[n], "save") == 0) {
            do_save++;
            n++;
        }
        for (which = 0; which < ARRAY_SIZE(config_set); which++) {
            const char *cs_name = config_set[which].cs_name;
            if (strcmp(cs_name, argv[n]) == 0) {
                uint16_t    cs_offset = config_set[which].cs_offset;
                uint8_t     cs_size   = config_set[which].cs_size;
                uint8_t     cs_mode   = config_set[which].cs_mode;
                const char *mode_str = "%d%n";
                int         value;
                int         pos = 0;
                if (strcmp(argv[n + 2], "save") == 0) {
                    do_save++;
                    argc--;
                }
                if (argc - n != 2) {
                    printf("%s value required\n", cs_name);
                    return (RC_BAD_PARAM);
                }
                if (cs_mode & MODE_HEX)
                    mode_str = "%x%d";
                if ((sscanf(argv[n + 1], mode_str, &value, &pos) != 1) ||
                    (argv[n + 1][pos] != '\0') ||
                    (((cs_mode & MODE_SIGNED) == 0) && (value < 0))) {
invalid_value:
                    printf("Invalid value %s for %s\n", argv[n + 1], cs_name);
                    return (RC_USER_HELP);
                }
                uint8_t *ptr = ((uint8_t *)&config) + cs_offset;
                switch (cs_size) {
                    default:
                    case 1:
                        if (value > 0x100)
                            goto invalid_value;
                        *ptr = value;
                        break;
                    case 2:
                        if (value >= 0x10000)
                            goto invalid_value;
                        *(uint16_t *)ptr = value;
                        break;
                    case 4:
                        *(uint32_t *)ptr = value;
                        break;
                }
                if (do_save)
                    config_updated();
                return (RC_SUCCESS);
            }
        }
        printf("set \"%s\" unknown argument\n", argv[1]);
        return (RC_USER_HELP);
    }

    return (RC_SUCCESS);
}


rc_t
cmd_snoop(int argc, char * const *argv)
{
    printf("Snoop not implemented\n");
    return (RC_USER_HELP);
#if 0
    uint mode = CAPTURE_SW;
    if (argc > 1) {
        if (strcmp(argv[1], "addr") == 0) {
            mode = CAPTURE_ADDR;
        } else if (strncmp(argv[1], "low", 2) == 0) {
            mode = CAPTURE_DATA_LO;
        } else if (strncmp(argv[1], "high", 2) == 0) {
            mode = CAPTURE_DATA_HI;
        } else {
            printf("snoop \"%s\" unknown argument\n", argv[1]);
            return (RC_USER_HELP);
        }
    }
    bus_snoop(mode);

    return (RC_SUCCESS);
#endif
}
